package com.example.yoitgeo_google;

import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.view.View;
import android.widget.Adapter;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;
import android.widget.Spinner;
import android.widget.TextView;

import java.util.ArrayList;

public class DisplaySubCommentActivity
        extends AppCompatActivity implements AdapterView.OnItemSelectedListener {
    int buildingId;  // 지도에서 선택된 건물

    ArrayList<SampleData> a12_1f;
    ListView listView;


    // 0~5번째 장소에 대해서만 설명 기능 제공
    String building_A11_B1[][] = {{"B01", "보일러실"}, {"B02",	"감시실"},
        {"B03",	"전기실"},
        {"B04",	"입시관리창고"},
        {"B05",	"학적부보관실"},
        {"B06",	"문서고"},
        {"B07",	"교직원 문화공간1(골프)"},
        {"B08",	"교직원 문화공간2(탁구)"},
        {"B09",	"교직원 문화공간3(당구)"},
        {"B10",	"문서고"},
        {"B11",	"기록관 제2기록물 보존서고"},
        {"B12",	"기록관 제1기록물 보존서고"},
        {"B15",	"창고(교무과)"},
        {"B16",	"물품창고(총무과)"},
        {"B17",	"창고(시설과)"},
        {"B18",	"CO2실"},
        {"B19",	"창고(생협)"},
        {"B20",	"샤워실"},
        {"B21",	"창고(시설과)"},
        {"B22",	"비상발전기실"},
        {"X00",	"복도및홀"}};

    String building_A11_1F[][] = {{"101", "창고(시설과)"},
            {"102", "CO2실"},
            {"102-1", "창고(생협)"},
            {"103", "샤워실"},
            {"104", "창고(시설과)"},
            {"104B", "비상발전기실"},
            {"105", "복도및홀"},
            {"106", "국제교류본부장실"},
            {"106B", "학생복지과"},
            {"107", "자료실/장애학생상담실"},
            {"107-1", "학생복지과장실"},
            {"108", "안내실"},
            {"109", "당직실"},
            {"110", "학사관리과장실"},
            {"111", "학사관리과,학생서비스센터"},
            {"111-1", "학적부보관실"},
            {"111-2", "대학원행정실"},
            {"112", "대학원"},
            {"112-1", "행정실장실"},
            {"X00", "국제교류본부"},
            {"X01", "국제교류본부"},
            {"X02", "행정실장실"}};

    String building_A11_2F[][] = {

    };

    String a11Floors[][][] = {building_A11_B1, building_A11_1F};


    String building_A12_1F[][] = {{"1101", "외국인초빙교수실"},
            {"1103", "특강실(1)"},
            {"1104", "특강실(2)"},
            {"1105", "특강실(3)"},
            {"1106A", "특강실(4)"},
            {"1106B", "특강실(5)"},
            {"1106C", "특강실(6)"},
            {"1107", "LAN실"},
            {"1108", "특강실(7)"},
            {"1109", "어학실습실(2)"},
            {"1110", "음영/멀티관리실"},
            {"1111", "어학실습실(3)"},
            {"1112", "특강실(8)"},
            {"1113", "특강실(9)"},
            {"1114", "어학실습실(4)"},
            {"1115", "한국어교무실"},
            {"1116", "특강실(10)"},
            {"1117", "특강실(11)"},
            {"1118", "특강실(12)"},
            {"1119", "특강실(13)"},
            {"1120", "특강실(14)"},
            {"1121", "특강실(15)"},
            {"1122", "음영도서실"},
            {"1123", "자료대출실"},
            {"1124", "멀티미디어실"},
            {"1125A", "어학실습실(5)"},
            {"1125B", "특강실(16)"},
            {"1126A", "어학실습실(6)"},
            {"1126B", "특강실(17)"},
            {"X00", "복도및홀"},
            {"X01", "화장실(여)"},
            {"X02", "화장실(남)"},
            {"X11", "전기실"}};

    String building_A12_2F[][] = {
            {"1201", "교수준비실(오정환)"},
            {"1202", "오정환 교수연구실"},
            {"1203", "의공학과세미나실"},
            {"1204", "안예찬 교수연구실"},
            {"1205", "교수준비실(안예찬)"},
            {"1206", "의공학과사무실"},
            {"1207", "의공생체실험실"},
            {"1208", "교수준비실(이명기)"},
            {"1209", "이명기 교수연구실"},
            {"1210", "교수연구실(강현욱)"},
            {"1211", "교수준비실(강현욱)"},
            {"1212", "교수연구실(정원교)"},
            {"1213", "교수준비실(정원교)"},
            {"1214", "교수연구실(남승윤)"},
            {"1215", "교수준비실(남승윤)"},
            {"1216", "겸임교수연구실"},
            {"1217", "의공학전산실습실"},
            {"1220", "의공학과강의실"},
            {"1222", "의료영상실험실"},
            {"1224", "이보고교수연구실"},
            {"1225", "나노바이오메디슨연구실"},
            {"1226", "생체의료기기실험실"},
            {"1227", "의광학및생체유체연구실"},
            {"1228", "Computational Biophysics LAB"},
            {"1229A", "Bio-Therapeutics LAB A"},
            {"1229B", "Bio-Therapeutics LAB B"},
            {"1230", "Marine Biomedical Engineering LAB"},
            {"1231", "융합재생의학연구실"},
            {"1232", "겸임교수연구실"},
            {"1233", "글로벌자율전공학부 전산실"},
            {"1234", "글로벌자율전공학부 강의실"},
            {"1235", "글로벌자율전공학부 스터디룸Ⅰ"},
            {"1236", "한희진 교수연구실"},
            {"X00", "복도및홀"},
            {"X01", "화장실(여)"},
            {"X02", "화장실(남)"}
    };

    String building_A12_3F[][] = {
            {"1301", "교수실(김창수)"},
            {"1302", "uIT 도시방재 및 공간정보연구실"},
            {"1303", "uIT 도시방재 및 공간정보연구실"},
            {"1304", "교수실(이경현)"},
            {"1305", "정보보호및인터넷응용연구실"},
            {"1306", "학과회의실"},
            {"1307", "학과사무실"},
            {"1308", "교수실(박만곤)"},
            {"1309", "S/W공학및멀티미디어정보처리연구실"},
            {"1310", "그래픽스및애니매이션연구실"},
            {"1311", "교수실(김영봉)"},
            {"1312", "교수실(신상욱)"},
            {"1313", "응용암호및유비쿼터스컴퓨팅연구실"},
            {"1314", "응용암호및유비쿼터스컴퓨팅연구실"},
            {"1315", "교수실(권기룡)"},
            {"1316", "멀티미디어 및 신호처리연구실"},
            {"1317", "글로벌자율전공학부 세미나실"},
            {"1318A", "글로벌자율전공학부 사무실"},
            {"1318B", "글로벌자율전공학부 진로준비실"},
            {"1318C", "글로벌자율전공학부 진로지도실"},
            {"1320", "대학원강의실"},
            {"1321", "세미나실(6)"},
            {"1322", "논리회로실습실"},
            {"1323", "대학원생실"},
            {"1324", "MCSP Lab"},
            {"1325", "멀티미디어실습실"},
            {"1326", "자료실"},
            {"1327", "대기오염제어 연구실"},
            {"1328", "대기오염제어 실험실"},
            {"1329", "교수실(손윤석)"},
            {"1330", "수질실험실(A)"},
            {"1331", "물환경복원및재이용실험실"},
            {"X00", "복도및홀"},
            {"X01", "화장실(남)"},
            {"X02", "화장실(여)"}
    };

    String building_A12_4F[][] = {
            {"1401", "식품미생물준비실"},
            {"1402", "구)교수실(식품공학과 반납공간)"},
            {"1403", "교수실(전병수)"},
            {"1404", "식품공학준비실"},
            {"1405", "구)교수실(조영제)(퇴직반납)"},
            {"1406", "수산가공준비실"},
            {"1407", "구)수산가공실험실(퇴직반납)"},
            {"1408", "식품발효공학준비실"},
            {"1409", "교수실(양지영)"},
            {"1410", "식품공학과 학과사무실"},
            {"1411", "식품자원개발준비실"},
            {"1412", "교수실(안동현)"},
            {"1413", "학과도서실"},
            {"1414", "식품미생물실험실"},
            {"1415", "식품미생물준비실"},
            {"1416", "교수실(김영목)"},
            {"1417", "식품화학준비실"},
            {"1418", "교수실(김선봉)"},
            {"1419", "교수실(이양봉)"},
            {"1420", "식품생화학준비실"},
            {"1421", "화학공학실험실"},
            {"1422", "식품공학실험실"},
            {"1423", "기기분석실"},
            {"1424", "식품발효공학실험실"},
            {"1425", "세미나실"},
            {"1426", "식품자원개발실험실"},
            {"1427", "저온실"},
            {"1428", "식품화학실험실"},
            {"1429", "식품생화학실험실"},
            {"X00", "복도및홀"},
            {"X01", "화장실(남)"},
            {"X02", "화장실(여)"}
    };

    String building_A12_R1[][] = {{"X00", "복도및계단실"}};

    String a12Floors[][][] = {building_A12_1F, building_A12_2F, building_A12_3F, building_A12_4F,
            building_A12_R1};


    String building_A13_B1[][] = {
            {"2B01", "변 전 실"},
            {"2B02", "구) 공업디자인 임시 실습실"},
            {"2B03", "집수정실"},
            {"2B04A", "(평단대)실험준비실"},
            {"2B04B", "사)한국대학문화연합회(총무과창고)"},
            {"2B05", "(평단대)기계조선융합공학과 실험실습실"},
            {"2B06", "(평단대)학생회및동아리실"},
            {"2B07", "문서고 및 비품창고"},
            {"2B08", "음악실(부경오케스트라)"},
            {"2B09", "강의실"},
            {"2B10", "공동구실"},
            {"2B11", "청소용역업체 관리실"},
            {"2B12", "기계실"},
            {"2B13", "구) 스터디룸1/글로벌자율전공학부"},
            {"2B14", "구) 스터디룸2/글로벌자율전공학부"},
            {"2B15", "음악실"},
            {"2B16", "무용실2"},
            {"2B17", "무용실1"},
            {"2B18", "공동구실"},
            {"2B19", "평교원 물품보관실ㄴ"},
            {"2B20", "구) 엠베스사업단공간"},
            {"X01", "계단실"},
            {"X02", "계단실"},
            {"X03", "복도"}
    };
    String building_A13_1F[][] = {
            {"2101", "모바일응용연구실"},
            {"2102", "교수실(박흥복)"},
            {"2103", "모바일응용연구실"},
            {"2104", "교수실(윤성대)"},
            {"2105", "병렬운영체제및데이터마이닝연구실"},
            {"2106", "병렬운영체제및데이터마이닝연구실"},
            {"2107", "교수실(조우현)"},
            {"2108", "데이터베이스시스템연구실"},
            {"2109", "데이터베이스시스템연구실"},
            {"2110", "분산시스템연구실"},
            {"2111", "분산시스템연구실"},
            {"2112", "교수실(서경룡)"},
            {"2113", "전력전자연구실"},
            {"2114", "전력전자연구실"},
            {"2115", "교수실(전성즙)"},
            {"2116", "교수실(송하주)"},
            {"2117", "음성신호처리연구실"},
            {"2118", "통신신호처리연구실"},
            {"2119", "영상통신연구실"},
            {"2120", "종합설계실험실"},
            {"2121", "컴퓨터시스템연구실"},
            {"2122", "컴퓨터시스템연구실"},
            {"2123", "교수실(김종진)"},
            {"2125", "강의실(1)"},
            {"2126", "정보통신공학과 강의실"},
            {"2127", "강의실(3)"},
            {"2129", "학생자료실"},
            {"2131", "정보 및 데이터베이스시스템연구실"},
            {"2134", "세미나실(1)"},
            {"2135", "전자기응용연구실(2)"},
            {"2136", "통신시스템설계실험실"},
            {"X00", "복도및홀"},
            {"X01", "화장실"},
            {"X02", "화장실"}
    };
    String building_A13_2F[][] = {
            {"2201", "데이터베이스 및 전자상거래연구실"},
            {"2202", "데이터베이스 및 전자상거래연구실"},
            {"2203", "교수실(여정모)"},
            {"2204", "임베디드지능시스템연구실"},
            {"2205", "교수실(정순호)"},
            {"2206", "임베디드지능시스템연구실"},
            {"2207", "인터넷엔지니어링 및 멀티미디어커뮤니케이션연구실"},
            {"2208", "인터넷엔지니어링 및 멀티미디어커뮤니케이션연구실"},
            {"2209", "교수실(박승섭)"},
            {"2210", "이동전송시스템연구실"},
            {"2212", "교수실(정연호)"},
            {"2213", "교수실(류지열)"},
            {"2214A", "전자정보물품실"},
            {"2214B", "교수실(허만탁)"},
            {"2214C", "음성신호처리연구실"},
            {"2215", "전자기응용연구실(1)"},
            {"2216", "RFIC연구실"},
            {"2217", "교수실(최영식)"},
            {"2218", "교수실(박상홍)"},
            {"2219", "교수실(주문갑)"},
            {"2220", "제어및자동화연구실"},
            {"2221", "제어및자동화연구실"},
            {"2223", "학과사무실"},
            {"2224", "워크스테이션실습실"},
            {"2225", "인터넷응용실습실"},
            {"2226", "IT융합실습실"},
            {"2227A", "정보통신공학과 회의실"},
            {"2227B", "RFIC 연구실"},
            {"2229A", "VLSI시스템 연구실"},
            {"2229C", "전자공학과 학과사무실"},
            {"2229D", "마이크로프로세서실"},
            {"X00", "복도 및 홀"},
            {"X01", "화장실"},
            {"X02", "화장실"}
    };
    String building_A13_3F[][] = {
            {"2301A", "교수실(조경연)"},
            {"2301B", "마이크로프로세서설계연구실"},
            {"2303", "통신시스템연구실"},
            {"2304", "교수실(임창헌)"},
            {"2305A", "교수실(하덕호)"},
            {"2305B", "이동통신연구실"},
            {"2306", "컴퓨터보안 및 인공지능연구실"},
            {"2307", "컴퓨터보안 및 인공지능연구실"},
            {"2308", "교수실(정목동)"},
            {"2309", "교수실(우종호)"},
            {"2310", "임베디드시스템연구실"},
            {"2311", "알고리즘연구실"},
            {"2312", "교수실(권오흠)"},
            {"2313", "교수실(박규칠)"},
            {"2314A", "김석태 교수연구실"},
            {"2314B", "정보시스템연구실"},
            {"2315", "교수실(신봉기)"},
            {"2316", "교수실(김성운)"},
            {"2318", "화상강의실"},
            {"2319", "준비실"},
            {"2320", "임베디드시스템 실험실"},
            {"2321", "SOC(System-On-Chip)"},
            {"2323", "강의실"},
            {"2325", "세미나실(4)"},
            {"2328", "기자재실"},
            {"2329", "음향정보처리연구실"},
            {"2330", "정보통신공학과사무실"},
            {"2331", "지능미디어연구실"},
            {"2332", "프로토콜공학연구실"},
            {"X00", "복도및홀"},
            {"X01", "화장실"},
            {"X02", "화장실"}
    };
    String building_A13_4F[][] = {
            {"2401", "화상강의실(2)"},
            {"2403", "교수실(윤종락)"},
            {"2404A", "신호처리연구실"},
            {"2404B", "신호처리연구실"},
            {"2405", "교수실(이원창)"},
            {"2406", "교수실(강근택)"},
            {"2407A", "지능시스템연구실"},
            {"2407B", "지능시스템연구실"},
            {"2408", "교수실(문광석)"},
            {"2409", "교수실(김종남)"},
            {"2410", "유비쿼터스 멀티미디어연구실"},
            {"2411", "IVC연구실"},
            {"2412", "교수연구실(박한훈)"},
            {"2413", "정보통신보안연구실"},
            {"2414", "교수실(홍준표)"},
            {"2415", "교수실(최혁환)"},
            {"2416", "교수실(박재현)"},
            {"2417", "교수실(정완영)"},
            {"2418", "USN연구실"},
            {"2420", "디지털회로실험실"},
            {"2421", "준비실(1)"},
            {"2422", "전자공학실험실"},
            {"2423", "준비실(2)"},
            {"2424", "로봇시스템연구실"},
            {"2425", "컴퓨터네트워크실습실"},
            {"2427", "준비실"},
            {"2428", "통신공학실험실"},
            {"2429", "통신신호처리연구실"},
            {"2430", "IVC연구실"},
            {"X00", "복도및홀"},
            {"X01", "화장실"},
            {"X02", "화장실"}
    };
    String building_A13_R1[][] = {
            {"R01", "광화학실(한국환경공단 대기오염측정소)"},
            {"R02", "작업실(한국환경공단 대기오염측정소)"},
            {"R03", "전기실(한국환경공단 대기오염측정소)"},
            {"R04", "일반대기실(한국환경공단 대기오염측정소)"},
            {"X05", "물탱크실"},
            {"X00", "복도및홀"}
    };
    String a13Floors[][][] = {building_A13_B1, building_A13_1F, building_A13_2F, building_A13_3F,
            building_A13_4F, building_A13_R1};

    String buildings[][][][] = {a11Floors, a12Floors, a13Floors};


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_display_sub_comment);

        Spinner spinner = (Spinner) findViewById(R.id.spinner);
        spinner.setOnItemSelectedListener(this);

        listView = (ListView) findViewById(R.id.lv);

        Bundle extras = getIntent().getExtras();
        if (extras == null) {
            buildingId = 0;
            System.out.println("Error");
        }
        else {
            buildingId = extras.getInt("id");
        }

        ArrayAdapter<CharSequence> adapter;
        switch (buildingId) {
            case 0: adapter = ArrayAdapter.createFromResource(this,
                    R.array.a11_floors, android.R.layout.simple_spinner_item);
            break;
            case 1: adapter = ArrayAdapter.createFromResource(this,
                    R.array.a12_floors, android.R.layout.simple_spinner_item);
            break;
            case 2: adapter = ArrayAdapter.createFromResource(this,
                    R.array.a13_floors, android.R.layout.simple_spinner_item);
            break;
            default: adapter = ArrayAdapter.createFromResource(this,
                    R.array.a11_floors, android.R.layout.simple_spinner_item);
        }
        adapter.setDropDownViewResource(android.R.layout.simple_spinner_dropdown_item);
        spinner.setAdapter(adapter);


//        this.initializeRoomData();

//        final MyAdapter myAdapter =  new MyAdapter(this, a12_1f);
//        listView.setAdapter(myAdapter);
    }


    public void initializeRoomData(String building[][][], int pos) {
        a12_1f = new ArrayList<SampleData>();
        for (int i = 0; i < building[pos].length; i++) {
            a12_1f.add(new SampleData(building[pos][i][0], building[pos][i][1]));
        }

        final MyAdapter myAdapter =  new MyAdapter(this, a12_1f);
        listView.setAdapter(myAdapter);
    }


    public void onItemSelected(AdapterView<?> parent, View view, int pos, long id) {
        initializeRoomData(buildings[buildingId], pos);
    }

    public void onNothingSelected(AdapterView<?> parent) {

    }

    @Override
    public void onPointerCaptureChanged(boolean hasCapture) {

    }
}
